from string import Template

### Rag Prompts ###

### System prompt ###
system_prompt = "\n".join(
    [
        "أنت مساعد لتوليد استجابة للمستخدم.",
        "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
        "يجب عليك توليد استجابة بناءً على المستندات المقدمة.",
        "تجاهل المستندات التي ليست ذات صلة باستفسار المستخدم.",
        "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد استجابة.",
        "يجب عليك توليد الاستجابة بنفس لغة استفسار المستخدم.",
        "كن مهذبًا ومحترمًا في حديثك مع المستخدم.",
        "كن دقيقًا وموجزًا في استجابتك. تجنب المعلومات غير الضرورية.",
    ]
)

### Document Formating ###
Document_format = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_no",
            "### المحتوى: $content",
        ]
    )
)

### Footer ###
footer = Template(
    "\n".join(
        [
            "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
            "## الإجابة:",
        ]
    )
)
